INSERT INTO crop_base (crop_name, crop_plant_season) VALUES
('토마토', '3,4,5'),
('고추', '4,5'),
('옥수수', '5,6'),
('오이', '3,4,5'),
('콩', '5,6'),
('가지', '4,5'),
('무', '8,9'),
('상추', '3,4'),
('배추', '9,10'),
('감자', '3,4'),
('고구마', '5,6'),
('대파', '3,4,9');

INSERT INTO crop_water_period (crop_id, watering_step1, watering_step2, watering_step3, watering_step4) VALUES
(1, 3, 7, 10, 14),
(2, 5, 10, 12, 15),
(3, 7, 10, 14, 20),
(4, 3, 7, 10, 14),
(5, 5, 7, 10, 12),
(6, 5, 10, 12, 15),
(7, 7, 14, 21, 28),
(8, 3, 7, 10, 14),
(9, 5, 7, 10, 12),
(10, 3, 7, 10, 14),
(11, 7, 10, 14, 20),
(12, 5, 10, 12, 15);


INSERT INTO growth_temp (crop_id, growth_high_temp, growth_low_temp) VALUES
(1, 30.0, 18.0),
(2, 30.0, 20.0),
(3, 28.0, 18.0),
(4, 28.0, 18.0),
(5, 25.0, 18.0),
(6, 30.0, 18.0),
(7, 28.0, 18.0),
(8, 20.0, 15.0),
(9, 24.0, 18.0),
(10, 25.0, 15.0),
(11, 28.0, 20.0),
(12, 30.0, 18.0);

INSERT INTO crop_fertilizer (fertilizer_id, fertilizer_type, fertilizer_name) VALUES
(1, '질소 비료', '삼양화학 질소 비료'),          -- 질소 비료
(2, '칼슘 비료', '코스트칼슘비료'),              -- 칼슘 비료
(3, '복합 비료', '한일비료 NK 복합비료'),         -- 복합 비료
(4, '유박 비료', '경농 유박비료'),               -- 유박 비료
(5, '칼륨 비료', '팜한농 올코팅 프리미엄'),       -- 칼륨 비료
(6, '인산 비료', '금호 비료 인산칼륨');           -- 인산 비료


INSERT INTO crop_fertilizer_period
(crop_id, fertilizer_step1, fertilizer_step2, fertilizer_step3, fertilizer_step4, fertilizer_step1_id, fertilizer_step2_id, fertilizer_step3_id, fertilizer_step4_id)
VALUES
-- 토마토: 칼슘, 질소, 인산, 복합비료 사용
(1, 1, 1, 1, 1, 2, 1, 6, 3),

-- 고추: 복합비료, 유박, 칼륨, 복합비료 사용
(2, 1, 1, 1, 1, 3, 4, 5, 3),

-- 옥수수: 질소, 칼륨, 인산, 질소비료 사용
(3, 1, 1, 1, 1, 1, 5, 6, 1),

-- 오이: 유박, 칼슘, 질소, 유박비료 사용
(4, 1, 1, 1, 1, 4, 2, 1, 4),

-- 콩: 칼륨, 인산, 질소, 칼륨비료 사용
(5, 1, 1, 1, 1, 5, 6, 1, 5),

-- 가지: 인산, 복합, 유박, 인산비료 사용
(6, 1, 1, 1, 1, 6, 3, 4, 6),

-- 무: 칼슘, 질소, 인산, 칼슘비료 사용
(7, 1, 1, 1, 1, 2, 1, 6, 2),

-- 상추: 복합비료, 유박비료, 칼륨비료 사용
(8, 1, 1, 1, 1, 3, 4, 5, 3),

-- 배추: 칼륨, 인산, 질소, 칼륨비료 사용
(9, 1, 1, 1, 1, 5, 6, 1, 5),

-- 감자: 칼슘, 질소, 인산, 칼슘비료 사용
(10, 1, 1, 1, 1, 2, 1, 6, 2),

-- 고구마: 유박, 칼슘, 복합비료 사용
(11, 1, 1, 1, 1, 4, 2, 3, 4),

-- 대파: 복합, 유박, 칼륨비료 사용
(12, 1, 1, 1, 1, 3, 4, 5, 3);
